---
kind: method
id: M:Autodesk.Revit.DB.SweptBlend.GetVertexConnectionMap
source: html/ec201a92-0f7e-5b90-f34d-d68757268cdf.htm
---
# Autodesk.Revit.DB.SweptBlend.GetVertexConnectionMap Method

Gets the mapping between the vertices in the top and bottom profiles.

## Syntax (C#)
```csharp
public VertexIndexPairArray GetVertexConnectionMap()
```

## Remarks
Each vertex refers to the start point of the curve from the top and bottom profiles.